{"authorDailyContributionsMap":{"Promist-Moon":[{"date":"2025-08-19T00:00:00","commitResults":[{"hash":"aa94fd762331dad595c95c335c0c01e16900a401","isMergeCommit":false,"messageTitle":"Chatbot for iP needs initial skeletal setup","messageBody":"Duke was the default setup for CS2103T\u0027s iP project, chatbot needs to be personalised\n\nRename Duke.java to Locky.java and update greeting and exit messages.\n\nLocky is short and memorable and tied to the Gen-Z phrase \"lock in\" making it effective for a study to-do chatbot.\n\nAll traces of \"Duke\" are removed from the codebase to avoid confusion\n","tags":["Level-0"],"fileTypesAndContributionMap":{"java":{"insertions":23,"deletions":10},"bat":{"insertions":1,"deletions":1},"sh":{"insertions":1,"deletions":1}}}]},{"date":"2025-08-20T00:00:00","commitResults":[{"hash":"f76d10bb1c0529d155a34039d25762f1efe1392c","isMergeCommit":false,"messageTitle":"The chatbot only greets the user once and then waits for input, but does not properly echo commands or exit cleanly when \"bye\" is typed.","messageBody":"Without a loop that echoes the commands, the chatbot will not meet Level 1 requirements\n\nAn input loop that echoes any user command back to the console is implemented, and \"bye\" is added as a termination connection.\n\nEchoing commands is the most rudimentary way to assess the chatbot\u0027s interaction with user response, and adding a termination condition ensures it does not run forever.\n","tags":["Level-1"],"fileTypesAndContributionMap":{"java":{"insertions":16,"deletions":4}}},{"hash":"463df8b484c137480464c50c1073eed10fe7392f","isMergeCommit":false,"messageTitle":"The chatbot currently has no way to retain previous commands and list them out.","messageBody":"The chatbot should be able to store commands in a list and return them as prompted, in order to meet Duke Level-2 requirements.\n\nImplement an ArrayList to store user-entered text, update the loop to add non-list commands to the list, and handle list command to print all stored tasks.\n\nArrayList has no fixed limit on the number of items in a list, hence can expand dynamically. Additional conditional should be implemented to add list feature.\n\nEach added task is acknowledged with a confirmation message, and tasks are displayed in a numbered format when \"list\" is entered.\n","tags":["Level-2"],"fileTypesAndContributionMap":{"java":{"insertions":19,"deletions":4}}}]},{"date":"2025-08-21T00:00:00","commitResults":[{"hash":"b67f4d041311f72a49382d03fc4bfdacf21d85ed","isMergeCommit":false,"messageTitle":"Add the ability to mark tasks as done or undone to Locky.","messageBody":"Mark tasks as done to meet Level-3 specs in CS2103T iP\n\nIntroduce a class Task with properties description and isDone, and use mark and unmark markers to mark a task as done.\n\nUse a Task class to employ encapsulation to ensure code remains modular and external code does not interfere with internal.\n\nDisplay tasks with internal toString() method with [X] and [] markers.\n","tags":["Level-3"],"fileTypesAndContributionMap":{"java":{"insertions":49,"deletions":3}}}]},{"date":"2025-08-22T00:00:00","commitResults":[{"hash":"2a590be7945e9b01634c03915e34995c08c20e73","isMergeCommit":false,"messageTitle":"Add support for three different task types: Todo, Deadline, and Event","messageBody":"Meet iP requirements of CS2103T Level 4.\n\nApply inheritance by creating 3 subclasses of superclass Task, with Deadline taking in extra parameter deadline and Event extra parameters start and end.\n\nAdd additional support for extracting deadlines through importing Java regex library.\n","tags":["Level-4"],"fileTypesAndContributionMap":{"java":{"insertions":94,"deletions":16}}},{"hash":"9d256dcf4af306a13d305928032e5fdd076c3514","isMergeCommit":false,"messageTitle":"Add A-TextUiTesting with input/output redirection","messageBody":"Include input.txt and EXPECTED.txt within text-ui-test directory with runtest.sh scripts\n\nVerify chatbot responses to common commands and reduce need for manual testing.\n","tags":["A-TextUiTesting"],"fileTypesAndContributionMap":{"txt":{"insertions":7,"deletions":0}}}]},{"date":"2025-08-23T00:00:00","commitResults":[{"hash":"734e2f8cb63c439e8ac029bf1b3306e92afe24c9","isMergeCommit":false,"messageTitle":"Add error handling for invalid task inputs","messageBody":"Meet CS2103T iP Level 5 requirements.\n\nImplement the extension A-Exceptions by creating new LockyException class.\nCreate new function handleLine that throws LockyException for various incorrect inputs.\nUpdate input.txt and EXPECTED.txt to handle errors.\n\nDedicated LockyException communicates user-specific error in Locky, not generic runtime failure.\nNew function handleLine allows separation of concerns by isolating a function for parsing and validation, hence easier future maintenance of code.\nEnsure Locky is tested for invalid test cases.\n","tags":["Level-5"],"fileTypesAndContributionMap":{"txt":{"insertions":6,"deletions":0},"java":{"insertions":118,"deletions":60}}},{"hash":"e5193919d74f74e188179505a1e52f871a56bbf5","isMergeCommit":false,"messageTitle":"Add delete task feature to Locky.","messageBody":"Meet Level 6 requirements in CS2103T iP Level-6.\n\nAdd switch case \"delete\" to handleLine, within mark and unmark case.\n\nThis keeps parser patterns consistent. Keep in \"mark\" \"unmark\" case to reduce redundancy in error handling as all features require a task number.\n","fileTypesAndContributionMap":{"txt":{"insertions":3,"deletions":0},"java":{"insertions":5,"deletions":1}}},{"hash":"4052ecb05a222bd871c4aa934bbc54c079ff9492","isMergeCommit":false,"messageTitle":"Fix inputs and expected outputs with updated test cases.","messageBody":"Previously, no error handling for new \"delete\" task feature.\n\nAdded test cases \"delete\" and \"delete 2\".\n\nThese test cases implement both error handling and checking whether delete removes the task from list properly.\n","tags":["Level-6"],"fileTypesAndContributionMap":{"java":{"insertions":1,"deletions":1}}}]}]},"authorFileTypeContributionMap":{"Promist-Moon":{"java":236,"md":0,"fxml":0,"sh":1,"bat":1,"gradle":0,"txt":16}},"authorContributionVariance":{"Promist-Moon":2832.1875},"authorDisplayNameMap":{"Promist-Moon":"CS2103T-W08-2 EMIL..ANDY"}}
