{"authorDailyContributionsMap":{"Promist-Moon":[{"date":"2025-08-19T00:00:00","commitResults":[{"hash":"aa94fd762331dad595c95c335c0c01e16900a401","isMergeCommit":false,"messageTitle":"Chatbot for iP needs initial skeletal setup","messageBody":"Duke was the default setup for CS2103T\u0027s iP project, chatbot needs to be personalised\n\nRename Duke.java to Locky.java and update greeting and exit messages.\n\nLocky is short and memorable and tied to the Gen-Z phrase \"lock in\" making it effective for a study to-do chatbot.\n\nAll traces of \"Duke\" are removed from the codebase to avoid confusion\n","tags":["Level-0"],"fileTypesAndContributionMap":{"java":{"insertions":23,"deletions":10},"bat":{"insertions":1,"deletions":1},"sh":{"insertions":1,"deletions":1}}}]},{"date":"2025-08-20T00:00:00","commitResults":[{"hash":"f76d10bb1c0529d155a34039d25762f1efe1392c","isMergeCommit":false,"messageTitle":"The chatbot only greets the user once and then waits for input, but does not properly echo commands or exit cleanly when \"bye\" is typed.","messageBody":"Without a loop that echoes the commands, the chatbot will not meet Level 1 requirements\n\nAn input loop that echoes any user command back to the console is implemented, and \"bye\" is added as a termination connection.\n\nEchoing commands is the most rudimentary way to assess the chatbot\u0027s interaction with user response, and adding a termination condition ensures it does not run forever.\n","tags":["Level-1"],"fileTypesAndContributionMap":{"java":{"insertions":16,"deletions":4}}},{"hash":"463df8b484c137480464c50c1073eed10fe7392f","isMergeCommit":false,"messageTitle":"The chatbot currently has no way to retain previous commands and list them out.","messageBody":"The chatbot should be able to store commands in a list and return them as prompted, in order to meet Duke Level-2 requirements.\n\nImplement an ArrayList to store user-entered text, update the loop to add non-list commands to the list, and handle list command to print all stored tasks.\n\nArrayList has no fixed limit on the number of items in a list, hence can expand dynamically. Additional conditional should be implemented to add list feature.\n\nEach added task is acknowledged with a confirmation message, and tasks are displayed in a numbered format when \"list\" is entered.\n","tags":["Level-2"],"fileTypesAndContributionMap":{"java":{"insertions":19,"deletions":4}}}]}]},"authorFileTypeContributionMap":{"Promist-Moon":{"java":50,"md":0,"fxml":0,"sh":1,"bat":1,"gradle":0,"txt":0}},"authorContributionVariance":{"Promist-Moon":209.66862},"authorDisplayNameMap":{"Promist-Moon":"EMIL..ANDY"}}
